benchmarks/vllm/runpod_h100sxm/Qwen3-32B/qwen3_32b_TP4_DP2_in4096_out128_p500_c25_1a2719.txt
BENCHMARK: qwen3_32b_TP4_DP2_in4096_out128_p500_c25_1a2719
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x720f491a4ea0>, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=25, model='/root/models/Qwen3-32B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='./benchmarks/vllm/runpod_h100sxm/Qwen3-32B', result_filename='qwen3_32b_TP4_DP2_in4096_out128_p500_c25_1a2719.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-9a0c058d-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 04-10 10:08:41 [datasets.py:612] Sampling input_len from [4096, 4096] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 25

  0%|          | 0/500 [00:00<?, ?it/s]
  0%|          | 1/500 [00:03<25:39,  3.08s/it]
  3%|▎         | 14/500 [00:03<01:20,  6.04it/s]
  5%|▍         | 23/500 [00:03<00:45, 10.53it/s]
  6%|▌         | 30/500 [00:06<01:34,  4.96it/s]
  7%|▋         | 34/500 [00:06<01:16,  6.07it/s]
  8%|▊         | 38/500 [00:07<01:20,  5.77it/s]
 10%|█         | 51/500 [00:09<01:12,  6.16it/s]
 11%|█▏        | 57/500 [00:09<01:04,  6.82it/s]
 14%|█▍        | 69/500 [00:10<00:51,  8.44it/s]
 15%|█▌        | 76/500 [00:12<00:59,  7.14it/s]
 16%|█▌        | 79/500 [00:12<00:57,  7.34it/s]
 16%|█▋        | 82/500 [00:12<00:54,  7.74it/s]
 18%|█▊        | 88/500 [00:13<00:48,  8.48it/s]
 19%|█▉        | 97/500 [00:13<00:37, 10.62it/s]
 20%|█▉        | 99/500 [00:13<00:37, 10.78it/s]
 20%|██        | 101/500 [00:15<01:03,  6.26it/s]
 20%|██        | 102/500 [00:15<01:03,  6.24it/s]
 21%|██▏       | 107/500 [00:15<00:44,  8.80it/s]
 22%|██▏       | 109/500 [00:15<00:50,  7.73it/s]
 23%|██▎       | 113/500 [00:15<00:36, 10.66it/s]
 23%|██▎       | 115/500 [00:16<00:44,  8.67it/s]
 24%|██▍       | 119/500 [00:16<00:48,  7.88it/s]
 25%|██▌       | 126/500 [00:18<00:56,  6.68it/s]
 26%|██▌       | 130/500 [00:18<00:50,  7.32it/s]
 27%|██▋       | 137/500 [00:18<00:33, 10.76it/s]
 28%|██▊       | 139/500 [00:19<00:42,  8.40it/s]
 28%|██▊       | 142/500 [00:19<00:39,  9.10it/s]
 29%|██▉       | 144/500 [00:20<00:45,  7.89it/s]
 30%|██▉       | 148/500 [00:20<00:35,  9.86it/s]
 30%|███       | 150/500 [00:20<00:33, 10.48it/s]
 30%|███       | 152/500 [00:21<00:57,  6.07it/s]
 31%|███       | 154/500 [00:21<00:54,  6.32it/s]
 32%|███▏      | 160/500 [00:21<00:41,  8.26it/s]
 32%|███▏      | 162/500 [00:22<00:43,  7.80it/s]
 33%|███▎      | 166/500 [00:22<00:39,  8.46it/s]
 34%|███▍      | 171/500 [00:23<00:36,  9.06it/s]
 34%|███▍      | 172/500 [00:23<00:41,  7.97it/s]
 35%|███▌      | 176/500 [00:24<00:47,  6.80it/s]
 35%|███▌      | 177/500 [00:24<00:46,  7.01it/s]
 36%|███▌      | 178/500 [00:24<00:46,  7.00it/s]
 37%|███▋      | 183/500 [00:24<00:34,  9.07it/s]
 37%|███▋      | 186/500 [00:25<00:35,  8.86it/s]
 38%|███▊      | 189/500 [00:25<00:34,  8.92it/s]
 39%|███▊      | 193/500 [00:25<00:33,  9.15it/s]
 39%|███▉      | 197/500 [00:26<00:34,  8.68it/s]
 40%|███▉      | 198/500 [00:26<00:35,  8.62it/s]
 40%|████      | 201/500 [00:27<00:46,  6.50it/s]
 41%|████      | 204/500 [00:27<00:37,  7.94it/s]
 41%|████      | 205/500 [00:27<00:39,  7.47it/s]
 42%|████▏     | 211/500 [00:28<00:32,  8.85it/s]
 43%|████▎     | 214/500 [00:28<00:27, 10.57it/s]
 43%|████▎     | 216/500 [00:28<00:33,  8.42it/s]
 44%|████▍     | 220/500 [00:29<00:32,  8.74it/s]
 45%|████▍     | 223/500 [00:29<00:31,  8.67it/s]
 45%|████▍     | 224/500 [00:29<00:35,  7.71it/s]
 45%|████▌     | 226/500 [00:30<00:41,  6.54it/s]
 46%|████▌     | 228/500 [00:30<00:39,  6.86it/s]
 47%|████▋     | 233/500 [00:30<00:31,  8.44it/s]
 47%|████▋     | 236/500 [00:31<00:28,  9.24it/s]
 48%|████▊     | 239/500 [00:31<00:27,  9.38it/s]
 48%|████▊     | 241/500 [00:31<00:29,  8.84it/s]
 49%|████▉     | 244/500 [00:32<00:29,  8.70it/s]
 49%|████▉     | 246/500 [00:32<00:25,  9.87it/s]
 50%|████▉     | 248/500 [00:32<00:30,  8.25it/s]
 50%|████▉     | 249/500 [00:33<00:42,  5.86it/s]
 50%|█████     | 252/500 [00:33<00:37,  6.55it/s]
 52%|█████▏    | 258/500 [00:33<00:28,  8.45it/s]
 52%|█████▏    | 262/500 [00:34<00:20, 11.42it/s]
 53%|█████▎    | 264/500 [00:34<00:27,  8.73it/s]
 53%|█████▎    | 266/500 [00:34<00:25,  9.02it/s]
 54%|█████▎    | 268/500 [00:34<00:27,  8.45it/s]
 54%|█████▍    | 271/500 [00:35<00:28,  7.92it/s]
 55%|█████▍    | 273/500 [00:35<00:33,  6.85it/s]
 55%|█████▌    | 275/500 [00:36<00:36,  6.09it/s]
 56%|█████▌    | 280/500 [00:36<00:27,  8.01it/s]
 57%|█████▋    | 283/500 [00:36<00:25,  8.58it/s]
 57%|█████▋    | 286/500 [00:37<00:25,  8.44it/s]
 58%|█████▊    | 290/500 [00:37<00:24,  8.65it/s]
 59%|█████▉    | 294/500 [00:38<00:23,  8.86it/s]
 59%|█████▉    | 295/500 [00:38<00:23,  8.87it/s]
 59%|█████▉    | 297/500 [00:38<00:23,  8.51it/s]
 60%|█████▉    | 298/500 [00:38<00:25,  7.88it/s]
 60%|█████▉    | 299/500 [00:39<00:30,  6.64it/s]
 60%|██████    | 300/500 [00:39<00:30,  6.58it/s]
 60%|██████    | 302/500 [00:39<00:29,  6.73it/s]
 61%|██████    | 305/500 [00:39<00:21,  8.86it/s]
 62%|██████▏   | 308/500 [00:39<00:17, 10.69it/s]
 62%|██████▏   | 310/500 [00:40<00:18, 10.01it/s]
 62%|██████▏   | 312/500 [00:40<00:20,  9.05it/s]
 63%|██████▎   | 315/500 [00:40<00:22,  8.19it/s]
 64%|██████▍   | 319/500 [00:41<00:22,  8.20it/s]
 64%|██████▍   | 322/500 [00:41<00:19,  8.97it/s]
 65%|██████▍   | 323/500 [00:41<00:24,  7.28it/s]
 65%|██████▍   | 324/500 [00:41<00:24,  7.24it/s]
 65%|██████▌   | 326/500 [00:42<00:25,  6.92it/s]
 66%|██████▌   | 329/500 [00:42<00:19,  8.71it/s]
 66%|██████▌   | 330/500 [00:42<00:24,  7.06it/s]
 67%|██████▋   | 335/500 [00:42<00:12, 12.86it/s]
 67%|██████▋   | 337/500 [00:43<00:17,  9.27it/s]
 68%|██████▊   | 339/500 [00:43<00:18,  8.56it/s]
 68%|██████▊   | 341/500 [00:43<00:17,  9.27it/s]
 69%|██████▊   | 343/500 [00:44<00:18,  8.28it/s]
 69%|██████▉   | 345/500 [00:44<00:17,  8.86it/s]
 69%|██████▉   | 347/500 [00:44<00:20,  7.55it/s]
 70%|██████▉   | 348/500 [00:44<00:21,  7.14it/s]
 70%|██████▉   | 349/500 [00:45<00:22,  6.60it/s]
 70%|███████   | 350/500 [00:45<00:22,  6.53it/s]
 71%|███████   | 353/500 [00:45<00:20,  7.03it/s]
 71%|███████   | 355/500 [00:45<00:19,  7.49it/s]
 71%|███████▏  | 357/500 [00:46<00:19,  7.52it/s]
 73%|███████▎  | 363/500 [00:46<00:14,  9.20it/s]
 73%|███████▎  | 367/500 [00:47<00:14,  8.97it/s]
 74%|███████▍  | 371/500 [00:47<00:15,  8.44it/s]
 75%|███████▍  | 373/500 [00:47<00:15,  8.11it/s]
 75%|███████▍  | 374/500 [00:48<00:17,  7.29it/s]
 76%|███████▌  | 378/500 [00:48<00:14,  8.29it/s]
 76%|███████▌  | 379/500 [00:48<00:15,  7.99it/s]
 76%|███████▌  | 381/500 [00:48<00:14,  8.04it/s]
 76%|███████▋  | 382/500 [00:49<00:14,  8.24it/s]
 77%|███████▋  | 385/500 [00:49<00:12,  8.94it/s]
 78%|███████▊  | 388/500 [00:49<00:11,  9.81it/s]
 78%|███████▊  | 390/500 [00:49<00:12,  8.97it/s]
 79%|███████▊  | 393/500 [00:50<00:10, 10.35it/s]
 79%|███████▉  | 395/500 [00:50<00:11,  9.09it/s]
 79%|███████▉  | 396/500 [00:50<00:12,  8.31it/s]
 79%|███████▉  | 397/500 [00:50<00:13,  7.83it/s]
 80%|███████▉  | 398/500 [00:50<00:13,  7.72it/s]
 80%|███████▉  | 399/500 [00:51<00:17,  5.88it/s]
 80%|████████  | 402/500 [00:51<00:12,  8.11it/s]
 81%|████████  | 403/500 [00:51<00:13,  7.12it/s]
 81%|████████  | 405/500 [00:51<00:13,  7.26it/s]
 82%|████████▏ | 408/500 [00:52<00:11,  8.32it/s]
 82%|████████▏ | 409/500 [00:52<00:10,  8.53it/s]
 82%|████████▏ | 412/500 [00:52<00:08, 10.25it/s]
 83%|████████▎ | 414/500 [00:52<00:08, 10.40it/s]
 83%|████████▎ | 416/500 [00:52<00:08,  9.58it/s]
 83%|████████▎ | 417/500 [00:53<00:09,  8.66it/s]
 84%|████████▍ | 419/500 [00:53<00:09,  8.28it/s]
 84%|████████▍ | 420/500 [00:53<00:10,  7.36it/s]
 84%|████████▍ | 422/500 [00:53<00:08,  9.38it/s]
 85%|████████▍ | 424/500 [00:54<00:11,  6.64it/s]
 85%|████████▌ | 426/500 [00:54<00:10,  6.77it/s]
 86%|████████▌ | 429/500 [00:54<00:09,  7.41it/s]
 86%|████████▋ | 432/500 [00:55<00:08,  8.08it/s]
 87%|████████▋ | 434/500 [00:55<00:07,  8.41it/s]
 87%|████████▋ | 437/500 [00:55<00:06,  9.33it/s]
 88%|████████▊ | 440/500 [00:55<00:06,  9.42it/s]
 88%|████████▊ | 441/500 [00:55<00:06,  9.32it/s]
 89%|████████▊ | 443/500 [00:56<00:06,  9.35it/s]
 89%|████████▉ | 444/500 [00:56<00:07,  7.35it/s]
 89%|████████▉ | 447/500 [00:56<00:04, 10.68it/s]
 90%|████████▉ | 449/500 [00:57<00:07,  7.26it/s]
 90%|█████████ | 451/500 [00:57<00:07,  6.69it/s]
 91%|█████████ | 454/500 [00:57<00:06,  7.42it/s]
 91%|█████████ | 455/500 [00:57<00:05,  7.59it/s]
 91%|█████████▏| 457/500 [00:58<00:05,  7.86it/s]
 92%|█████████▏| 460/500 [00:58<00:04,  8.92it/s]
 93%|█████████▎| 463/500 [00:58<00:03,  9.45it/s]
 93%|█████████▎| 465/500 [00:58<00:04,  8.74it/s]
 94%|█████████▎| 468/500 [00:59<00:03, 10.40it/s]
 94%|█████████▍| 470/500 [00:59<00:03,  8.41it/s]
 94%|█████████▍| 471/500 [00:59<00:03,  7.76it/s]
 95%|█████████▍| 473/500 [00:59<00:03,  7.04it/s]
 95%|█████████▍| 474/500 [01:00<00:04,  6.49it/s]
 95%|█████████▌| 477/500 [01:00<00:02,  8.16it/s]
 96%|█████████▌| 480/500 [01:00<00:01, 10.13it/s]
 97%|█████████▋| 485/500 [01:00<00:01, 14.62it/s]
 97%|█████████▋| 487/500 [01:00<00:00, 15.17it/s]
 98%|█████████▊| 492/500 [01:01<00:00, 20.00it/s]
 99%|█████████▉| 495/500 [01:01<00:00, 17.98it/s]
 99%|█████████▉| 497/500 [01:01<00:00, 17.67it/s]
100%|█████████▉| 499/500 [01:01<00:00, 15.02it/s]
100%|██████████| 500/500 [01:01<00:00,  8.11it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             25        
Benchmark duration (s):                  61.67     
Total input tokens:                      2048000   
Total generated tokens:                  64000     
Request throughput (req/s):              8.11      
Output token throughput (tok/s):         1037.84   
Peak output token throughput (tok/s):    2364.00   
Peak concurrent requests:                50.00     
Total token throughput (tok/s):          34248.56  
---------------Time to First Token----------------
Mean TTFT (ms):                          393.93    
Median TTFT (ms):                        246.67    
P99 TTFT (ms):                           1678.39   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          20.88     
Median TPOT (ms):                        21.63     
P99 TPOT (ms):                           26.42     
---------------Inter-token Latency----------------
Mean ITL (ms):                           20.90     
Median ITL (ms):                         10.63     
P99 ITL (ms):                            142.58    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          3046.02   
Median E2EL (ms):                        3037.61   
P99 E2EL (ms):                           3997.83   
==================================================